GreatCowBASIC/DATFileGenerator/incfiles/p18lf24k42.inc
POSTINC0         EQU  H'3FEE'
INDF0            EQU  H'3FEF'
PCON0            EQU  H'3FF0'
PCON1            EQU  H'3FF1'
PROD             EQU  H'3FF3'
PRODL            EQU  H'3FF3'
PRODH            EQU  H'3FF4'
TABLAT           EQU  H'3FF5'
TBLPTR           EQU  H'3FF6'
TBLPTRL          EQU  H'3FF6'
TBLPTRH          EQU  H'3FF7'
TBLPTRU          EQU  H'3FF8'
PC               EQU  H'3FF9'
PCL              EQU  H'3FF9'
PCLATH           EQU  H'3FFA'
PCLATU           EQU  H'3FFB'
STKPTR           EQU  H'3FFC'
TOS              EQU  H'3FFD'
TOSL             EQU  H'3FFD'
TOSH             EQU  H'3FFE'
TOSU             EQU  H'3FFF'

;----- IPR1 Bits -----------------------------------------------------
INT0IP           EQU  H'0000'
ZCDIP            EQU  H'0001'
ADIP             EQU  H'0002'
ADTIP            EQU  H'0003'
C1IP             EQU  H'0004'
SMT1IP           EQU  H'0005'
SMT1PRAIP        EQU  H'0006'
SMT1PWAIP        EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
INT0IE           EQU  H'0000'
ZCDIE            EQU  H'0001'
ADIE             EQU  H'0002'
ADTIE            EQU  H'0003'
C1IE             EQU  H'0004'
SMT1IE           EQU  H'0005'
SMT1PRAIE        EQU  H'0006'
SMT1PWAIE        EQU  H'0007'


;----- PIR1 Bits -----------------------------------------------------
INT0IF           EQU  H'0000'
ZCDIF            EQU  H'0001'
ADIF             EQU  H'0002'
ADTIF            EQU  H'0003'
C1IF             EQU  H'0004'
SMT1IF           EQU  H'0005'
SMT1PRAIF        EQU  H'0006'
SMT1PWAIF        EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
TMR0MD           EQU  H'0000'
TMR1MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR3MD           EQU  H'0003'
TMR4MD           EQU  H'0004'
TMR5MD           EQU  H'0005'
TMR6MD           EQU  H'0006'
NCO1MD           EQU  H'0007'


;----- OSCCON1 Bits -----------------------------------------------------
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'


;----- DMA1PR Bits -----------------------------------------------------
;PR0              EQU  H'0000'
PR1              EQU  H'0001'
;PR2              EQU  H'0002'


DMA1PR0          EQU  H'0000'
DMA1PR1          EQU  H'0001'
DMA1PR2          EQU  H'0002'


;----- RA1PPS Bits -----------------------------------------------------
RA1PPS0          EQU  H'0000'
RA1PPS1          EQU  H'0001'
RA1PPS2          EQU  H'0002'
RA1PPS3          EQU  H'0003'
RA1PPS4          EQU  H'0004'
RA1PPS5          EQU  H'0005'


;----- RB1PPS Bits -----------------------------------------------------
RB1PPS0          EQU  H'0000'
RB1PPS1          EQU  H'0001'
RB1PPS2          EQU  H'0002'
RB1PPS3          EQU  H'0003'
RB1PPS4          EQU  H'0004'
RB1PPS5          EQU  H'0005'


;----- RC1PPS Bits -----------------------------------------------------
RC1PPS0          EQU  H'0000'
RC1PPS1          EQU  H'0001'
RC1PPS2          EQU  H'0002'
RC1PPS3          EQU  H'0003'
RC1PPS4          EQU  H'0004'
RC1PPS5          EQU  H'0005'


;----- RB1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- DMA1BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA1BUF0         EQU  H'0000'
DMA1BUF1         EQU  H'0001'
DMA1BUF2         EQU  H'0002'
DMA1BUF3         EQU  H'0003'
DMA1BUF4         EQU  H'0004'
DMA1BUF5         EQU  H'0005'
DMA1BUF6         EQU  H'0006'
DMA1BUF7         EQU  H'0007'


;----- DMA1DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA1DCNT0        EQU  H'0000'
DMA1DCNT1        EQU  H'0001'
DMA1DCNT2        EQU  H'0002'
DMA1DCNT3        EQU  H'0003'
DMA1DCNT4        EQU  H'0004'
DMA1DCNT5        EQU  H'0005'
DMA1DCNT6        EQU  H'0006'
DMA1DCNT7        EQU  H'0007'


;----- DMA1DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA1DCNT8        EQU  H'0000'
DMA1DCNT9        EQU  H'0001'
DMA1DCNT10       EQU  H'0002'
DMA1DCNT11       EQU  H'0003'


;----- DMA1DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA1DPTR0        EQU  H'0000'
DMA1DPTR1        EQU  H'0001'
DMA1DPTR2        EQU  H'0002'
DMA1DPTR3        EQU  H'0003'
DMA1DPTR4        EQU  H'0004'
DMA1DPTR5        EQU  H'0005'
DMA1DPTR6        EQU  H'0006'
DMA1DPTR7        EQU  H'0007'


;----- DMA1DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA1DPTR8        EQU  H'0000'
DMA1DPTR9        EQU  H'0001'
DMA1DPTR10       EQU  H'0002'
DMA1DPTR11       EQU  H'0003'
DMA1DPTR12       EQU  H'0004'
DMA1DPTR13       EQU  H'0005'
DMA1DPTR14       EQU  H'0006'
DMA1DPTR15       EQU  H'0007'


;----- DMA1DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA1DSZ0         EQU  H'0000'
DMA1DSZ1         EQU  H'0001'
DMA1DSZ2         EQU  H'0002'
DMA1DSZ3         EQU  H'0003'
DMA1DSZ4         EQU  H'0004'
DMA1DSZ5         EQU  H'0005'
DMA1DSZ6         EQU  H'0006'
DMA1DSZ7         EQU  H'0007'


;----- DMA1DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA1DSZ8         EQU  H'0000'
DMA1DSZ9         EQU  H'0001'
DMA1DSZ10        EQU  H'0002'
DMA1DSZ11        EQU  H'0003'


